src/test/resources/bikes.xml

<soapenv:Envelope
    xmlns="llc:jaradatbros:emd:api:soap:mongo"
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header />
    <soapenv:Body>
        <getBikeRequest>
            <name>Cannondale</name>
        </getBikeRequest>
    </soapenv:Body>
</soapenv:Envelope>